---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalStructuralRole.StructuralRoleMember
enum: Autodesk.Revit.DB.Structure.AnalyticalStructuralRole
source: html/687bab2b-0ad0-9dd9-f733-8e1a9e5fd44f.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalStructuralRole.StructuralRoleMember

Member plays role of structural member.